In [6]:
import pandas as pd
import numpy as np

In [9]:
from numpy import nan as NA

In [3]:
dates=pd.date_range('2019-07-01','2019-07-08')
dates

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-06', '2019-07-07', '2019-07-08'],
              dtype='datetime64[ns]', freq='D')

In [5]:
obj=pd.Series([45,54,21,41,65,21,78,98],index=dates)

In [51]:
student=pd.DataFrame({'Name':['Ahsan','Umer','Ali','Taha','Bilal'],
                    'age': np.random.randint(5,25,size=[5]),
                    'percentage':np.random.randint(50,90,size=[5])})

np.random.seed(5)

In [52]:
student

    Name  age  percentage
0  Ahsan   18          85
1   Umer   10          69
2    Ali   14          53
3   Taha   24          73
4  Bilal   16          53

In [56]:
def abc(age):
    if age>18:
        return 'Adult'
    else:
        return 'Non-Adult'

In [57]:
student['Status']=student['age'].map(abc) #we can use map or apply

In [58]:
student

    Name  age  percentage     Status
0  Ahsan   18          85  Non-Adult
1   Umer   10          69  Non-Adult
2    Ali   14          53  Non-Adult
3   Taha   24          73      Adult
4  Bilal   16          53  Non-Adult

In [59]:
def per(percentage):
    if percentage>70:
        return 'Pass'
    else:
        return 'Fail'

In [60]:
student['Result']=student['percentage'].map(per) #we can use map or apply

In [61]:
student

    Name  age  percentage     Status Result
0  Ahsan   18          85  Non-Adult   Pass
1   Umer   10          69  Non-Adult   Fail
2    Ali   14          53  Non-Adult   Fail
3   Taha   24          73      Adult   Pass
4  Bilal   16          53  Non-Adult   Fail

In [63]:
student[student.Status == 'Adult']

   Name  age  percentage Status Result
3  Taha   24          73  Adult   Pass

In [64]:
student

    Name  age  percentage     Status Result
0  Ahsan   18          85  Non-Adult   Pass
1   Umer   10          69  Non-Adult   Fail
2    Ali   14          53  Non-Adult   Fail
3   Taha   24          73      Adult   Pass
4  Bilal   16          53  Non-Adult   Fail

In [71]:
student[(student.Name.str.startswith('A'))]

    Name  age  percentage     Status Result
0  Ahsan   18          85  Non-Adult   Pass
2    Ali   14          53  Non-Adult   Fail

# The Lambda Function

In [6]:
f=lambda x: 2*x

In [7]:
f(3)

6

In [8]:
a=lambda b: 'Even' if b%2==0 else 'Odd'

In [9]:
a(7)

'Odd'